# Дана строка. Выведите в консоль длину этой строки.
text = input('Напишите текст: ')
text_len = len(text)
print(f"Длина строки: {text_len}")
