# Дана строка. Выведите в консоль последний символ строки.
word = input("Введите слово: ")
print(word[-1])
