# Дано число. Выведите количество цифр в этом числе.
print(len(str(abs(int(input("Введите число: "))))))
