"""Дан список:
[1, 2, 3, 4, 5, 6]
Получите из него следующий срез:
[1, 2, 3]"""
spisok = [1, 2, 3, 4, 5, 6]
result = spisok[:3]
print(result)
